package kr.mafin.naswallkitexample.common

import android.content.Context
import android.content.pm.ApplicationInfo
import android.util.Log
import kr.mafin.naswallkit.define.NasWallError

private const val tag = "NasWallKitSample"
private var showLog = false

/***************************************************************************************************
 * (PRIVATE) 로그 구분
 **************************************************************************************************/
private enum class LogType {
    Debug, Info, Success, Warning, Error
}

/***************************************************************************************************
 * (PRIVATE) 로그 출력
 **************************************************************************************************/
private fun printLog(type: LogType, text: String) {
    if (showLog) {
        when(type) {
            LogType.Debug -> Log.d(tag, "🐛 $text")
            LogType.Info -> Log.i(tag, "ℹ️ $text")
            LogType.Success -> Log.i(tag, "✅ $text")
            LogType.Warning -> Log.w(tag, "⚠️ $text")
            LogType.Error -> Log.e(tag, "🔥 $text")
        }

    }
}

/***************************************************************************************************
 * 로그 출력 초기화 - 디버그 모드 확인을 위한 용도
 **************************************************************************************************/
internal fun llInit(context: Context) {
    showLog = (context.applicationInfo.flags and ApplicationInfo.FLAG_DEBUGGABLE) != 0
}

/***************************************************************************************************
 * 디버그 로그 출력
 **************************************************************************************************/
internal fun ll(text: String) {
    printLog(LogType.Debug, text)
}

/***************************************************************************************************
 * 정보 로그 출력
 **************************************************************************************************/
internal fun lli(text: String) {
    printLog(LogType.Info, text)
}

/***************************************************************************************************
 * 성공 로그 출력
 **************************************************************************************************/
internal fun lls(text: String) {
    printLog(LogType.Success, text)
}

/***************************************************************************************************
 * 경고 로그 출력
 **************************************************************************************************/
internal fun llw(text: String) {
    printLog(LogType.Warning, text)
}

/***************************************************************************************************
 * 오류 로그 출력
 **************************************************************************************************/
internal fun lle(text: String) {
    printLog(LogType.Error, text)
}

/***************************************************************************************************
 * 오류 로그 출력
 **************************************************************************************************/
internal fun lle(error: NasWallError) {
    printLog(LogType.Error, "${error.code} | ${error.message}")
}

/***************************************************************************************************
 * 오류 로그 출력
 **************************************************************************************************/
internal fun lle(text: String, error: NasWallError) {
    printLog(LogType.Error, "$text | ${error.code} | ${error.message}")
}